Revit 2027 API
StructuralSettings.BoundaryConditionFamilySymbolRoller Property
 The id of the FamilySymbol to represent a roller boundary condition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BoundaryConditionFamilySymbolRoller { get; set; }
Public Property BoundaryConditionFamilySymbolRoller As ElementId
	Get
	Set
public:
property ElementId^ BoundaryConditionFamilySymbolRoller {
	ElementId^ get ();
	void set (ElementId^ value);
}
member BoundaryConditionFamilySymbolRoller : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace